Revit 2027 API
SketchedStairsCurveData Methods
The SketchedStairsCurveData type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCurve |  Get a copy of the curve that is formed along this boundary.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
SketchedStairsCurveData Class
Autodesk.Revit.DB Namespace